#+TITLE:     Marco Gualtieri / Log
#+AUTHOR:    Marco Gualtieri
#+EMAIL:     mgualt@math.toronto.edu
#+DATE:      2012-07-11 Wed
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:nil toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:0 toc:nil ltoc:nil mouse:rgb(230,230,230) buttons:nil path:scripts/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT:
#+STYLE:  <link rel="stylesheet" type="text/css" href="stylesheet.css" />

* <2012-07-12 Thu> Rating board                               :journals:math:
We need a replacement for journals - well known problem.  
I could just rate the papers I read. Provide a critique and comments,
modifications, notes etc.  Public information should be accessible 
and site could be joined by others. Check out what is happening online on this topic.
* <2012-07-12 Thu> Documents and Javascript                       :docs:math:
Mathematical documents need to evolve away from PDFs,
which are paper simulations, and towards active documents which have 
interactive features, such as:
- *folding* 
The ability to hide sections of the text to make reading simpler.
- *linking*
PDFs already have, but internal linking and linking to other documents
in a project or related web of documents would be good.
- *running animations or code*
Latex and orgmode have
- *versioning and branching*
People can modify papers in an automated way, create new versions,
combine results of sections and include sections as modules in other
papers.
- *org-info.js*
Something which may be helpful is the use of org-info.js which
encapsulates various javascript functions in a markup language so that
the precise nature of the javascript is hidden.  It would be good to
develop certain elementary operations which we would need for the
creation of web documents as an output format for orgmode used as a
mathematical document system. It already has Latex inter-operability,
so we could view it as a LaTeX enhancement which outputs to an active
webpage or wiki-like acrive document.

I would like to see any proposals or studies which deal with these
kinds of issues, especially to help decide what the core elements of
an active document would be.  Try to think about what goes into an AMS
article class document in LaTeX...  what would be the analog for an
active document.

* <2012-07-11 Wed> Geometry on a Lie group                             :math:
 Alejandro, Eckhard and I are writing a paper about obtaining geometry 
 on a Lie group via infinite-dimensional reduction.  This includes
 a (multiplicative) Courant algebroid structure as well as a multiplicative
 Dirac structure.  

 My main difficulty is that it is unclear what the big picture is - 
 how does it relate to work of Sullivan, Getzler, and Henriques?

* <2012-07-11 Wed> LP Integrable system (45/33 rpm trajectory)     :art:math:
Map from a torus to a plane.  
Should figure out a good way to make a 3d embedding.

 #+BEGIN_HTML
 <iframe src="http://player.vimeo.com/video/31933085?title=0&amp;byline=0&amp;portrait=0&amp;color=ffffff" width="500" height="281" frameborder="0" webkitAllowFullScreen mozallowfullscreen allowFullScreen></iframe> <p><a href="http://vimeo.com/31933085">Drawing Apparatus</a> from <a href="http://vimeo.com/user7412944">Robert Howsare</a> on <a href="http://vimeo.com">Vimeo</a>.</p>
 #+END_HTML


* COMMENT 
#+srcname: org-publish
#+BEGIN_SRC emacs-lisp
  (setq org-export-html-style-include-default nil)
  (setq org-export-html-postamble nil)
  (setq org-publish-project-alist
          '(("mysite"
             :base-directory "~/Dropbox/Web/mgualt-log/"
             :base-extension "org"
             :recursive t
             :section-numbers nil
             :table-of-contents nil
             :publishing-directory "~/Dropbox/Web/mgualt-log/public_html")
            ("css"
             :base-directory "~/Dropbox/Web/mgualt-log/"
             :base-extension "css"
             :publishing-directory "~/Dropbox/Web/mgualt-log/public_html"
             :publishing-function org-publish-attachment)
            ("imgs"
             :base-directory "~/Dropbox/Web/mgualt-log/imgs/"
             :base-extension "jpg\\|gif\\|png"
             :publishing-directory "~/Dropbox/Web/mgualt-log/public_html/imgs"
             :publishing-function org-publish-attachment)
            ("etc"
             :base-directory "~/Dropbox/Web/mgualt-log/"
             :base-extension "css\\|bib\\|el"
             :publishing-directory "~/Dropbox/Web/mgualt-log/public_html"
             :publishing-function org-publish-attachment)
            ("docs"
             :base-directory "~/Dropbox/Web/mgualt-log/docs/"
             :base-extension "html\\|tex\\|bib"
             :publishing-directory "~/Dropbox/Web/mgualt-log/public_html/docs"
             :publishing-function org-publish-attachment)
            ("scripts"
             :base-directory "~/Dropbox/Web/mgualt-log/scripts/"
             :base-extension "js"
             :publishing-directory "~/Dropbox/Web/mgualt-log/public_html/scripts"
             :publishing-function org-publish-attachment)

            ("thewholedamnshow" :components ("mysite" "css" "imgs" "etc" "docs" "scripts"))))
#+END_SRC

#+RESULTS:
| mysite           | :base-directory | ~/Dropbox/Web/mgualt-log/          | :base-extension | org   | :recursive            | t                                            | :section-numbers      | nil                                       | :table-of-contents   | nil                    | :publishing-directory | ~/Dropbox/Web/mgualt-log/public_html |
| css              | :base-directory | ~/Dropbox/Web/mgualt-log/          | :base-extension | css   | :publishing-directory | ~/Dropbox/Web/mgualt-log/public_html         | :publishing-function  | org-publish-attachment                    |                      |                        |                       |                                      |
| imgs             | :base-directory | ~/Dropbox/Web/mgualt-log/imgs/     | :base-extension | jpg\  | gif\                  | png                                          | :publishing-directory | ~/Dropbox/Web/mgualt-log/public_html/imgs | :publishing-function | org-publish-attachment |                       |                                      |
| etc              | :base-directory | ~/Dropbox/Web/mgualt-log/          | :base-extension | css\  | bib\                  | el                                           | :publishing-directory | ~/Dropbox/Web/mgualt-log/public_html      | :publishing-function | org-publish-attachment |                       |                                      |
| docs             | :base-directory | ~/Dropbox/Web/mgualt-log/docs/     | :base-extension | html\ | tex\                  | bib                                          | :publishing-directory | ~/Dropbox/Web/mgualt-log/public_html/docs | :publishing-function | org-publish-attachment |                       |                                      |
| scripts          | :base-directory | ~/Dropbox/Web/mgualt-log/scripts/  | :base-extension | js    | :publishing-directory | ~/Dropbox/Web/mgualt-log/public_html/scripts | :publishing-function  | org-publish-attachment                    |                      |                        |                       |                                      |
| thewholedamnshow | :components     | (mysite css imgs etc docs scripts) |                 |       |                       |                                              |                       |                                           |                      |                        |                       |                                      |

